In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']
                   })

In [3]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  3 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

## Q1

In [5]:
df["FlightNumber"].interpolate(method = "linear",inplace = True,limit_direction = 'forward')
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
df["FlightNumber"] = df["FlightNumber"].astype("int")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

## Q2

In [7]:
L = list(df["From_To"])
L

['LoNDon_paris',
 'MAdrid_miLAN',
 'londON_StockhOlm',
 'Budapest_PaRis',
 'Brussels_londOn']

In [8]:
Lc = [x.split("_") for x in L]      # Lc ----> List Comprehension
Lc

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [9]:
df.insert(1,"From",[Lc[0][0],Lc[1][0],Lc[2][0],Lc[3][0],Lc[4][0]],True)

In [10]:
df.insert(2,"To",[Lc[0][1],Lc[1][1],Lc[2][1],Lc[3][1],Lc[4][1]],True)
df

,From_To,From,To,FlightNumber,RecentDelays,Airline
0,LoNDon_paris,LoNDon,paris,10045,"[23, 47]",KLM(!)
1,MAdrid_miLAN,MAdrid,miLAN,10055,[],<Air France> (12)
2,londON_StockhOlm,londON,StockhOlm,10065,"[24, 43, 87]",(British Airways. )
3,Budapest_PaRis,Budapest,PaRis,10075,[13],12. Air France
4,Brussels_londOn,Brussels,londOn,10085,"[67, 32]","""Swiss Air"""

In [11]:
New_df = df.drop(["From_To"],axis = 1)
New_df

       From         To  FlightNumber  RecentDelays              Airline
0    LoNDon      paris         10045      [23, 47]               KLM(!)
1    MAdrid      miLAN         10055            []    <Air France> (12)
2    londON  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

## Q3

In [12]:
f = New_df["From"]
t = New_df['To']

In [13]:
From = f.str.capitalize()
From

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From, dtype: object

In [14]:
To2 = t.str.capitalize()
To2

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

In [15]:
New_df.insert(0,"FROM",From,True)
New_df.insert(1,"TO",To2,True)
New_df

,FROM,TO,From,To,FlightNumber,RecentDelays,Airline
0,London,Paris,LoNDon,paris,10045,"[23, 47]",KLM(!)
1,Madrid,Milan,MAdrid,miLAN,10055,[],<Air France> (12)
2,London,Stockholm,londON,StockhOlm,10065,"[24, 43, 87]",(British Airways. )
3,Budapest,Paris,Budapest,PaRis,10075,[13],12. Air France
4,Brussels,London,Brussels,londOn,10085,"[67, 32]","""Swiss Air"""

In [16]:
New_df.drop(["From","To"],axis = 1,inplace = True)
New_df

       FROM         TO  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

## Q4

In [17]:
df.drop(["From_To","From","To"],axis = 1,inplace = True)

In [18]:
df["From"] = New_df["FROM"] 
df["To"] = New_df["TO"]
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

## Q5

In [19]:
lis = list(df["RecentDelays"])
lis

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [20]:
df.insert(1,"delay_1",[lis[0][0],np.nan,lis[2][0],lis[3][0],lis[4][0]])
df.insert(2,"delay_2",[lis[0][1],np.nan,lis[2][1],np.nan,lis[4][1]],True)
df

,FlightNumber,delay_1,delay_2,RecentDelays,Airline,From,To
0,10045,23.0,47.0,"[23, 47]",KLM(!),London,Paris
1,10055,NaN,NaN,[],<Air France> (12),Madrid,Milan
2,10065,24.0,43.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,10075,13.0,NaN,[13],12. Air France,Budapest,Paris
4,10085,67.0,32.0,"[67, 32]","""Swiss Air""",Brussels,London

In [21]:
df.drop(["RecentDelays"],axis = 1,inplace = True)
df

   FlightNumber  delay_1  delay_2              Airline      From         To
0         10045     23.0     47.0               KLM(!)    London      Paris
1         10055      NaN      NaN    <Air France> (12)    Madrid      Milan
2         10065     24.0     43.0  (British Airways. )    London  Stockholm
3         10075     13.0      NaN       12. Air France  Budapest      Paris
4         10085     67.0     32.0          "Swiss Air"  Brussels     London